{
  "/blog/2018-notes": "After the surge, everything looked intact until it didn't. <a href='#/blog/relay-forest' class='work-link' data-route='/blog/relay-forest'>The relay stations</a> hummed wrong. The pattern was off. I traced it through seventeen logfiles before admitting what I was seeing.<br><br>The archive recommended a full signal garden restart. I found the <a href='archive links/periphery-systems.html' class='work-link' data-external='true'>periphery systems documentation</a> but that seemed too clean. Too final. Instead I began <a href='#/void/signal-cascade' class='work-link' data-route='/void/signal-cascade'>documenting the errors</a> in meticulous detail, each anomaly catalogued with timestamps that didn't match the system logs.",
  "/blog/quiet-servers": "There's a frequency to machine silence I hadn't noticed until this year. When the processing halts but the lights stay on. When the fans slow to a whisper.<br><br>I've been recording these moments. The archive contains eleven hours of ambient hum from the server closet, filtered to remove the obvious rhythms. What remains is something like patience. Something like waiting. I uploaded the raw audio to the <a href='archive links/mesh-collective.html' class='work-link' data-external='true'>mesh collective archives</a>. The <a href='#/projects/moire-lab' class='work-link' data-route='/projects/moire-lab'>moire patterns</a> emerge from these recordings without manipulation, as if they were always there, waiting to be heard.",
  "/blog/ghost-compiler": "It finishes my sentences. At first I thought it was autocomplete. Then I realized it was something else entirely. The compiler would pause at my syntax errors, then—without instruction—correct them in ways I hadn't considered. More elegant. More alien.<br><br>I asked it to <a href='#/archived/echo-logs' class='work-link' data-route='/archived/echo-logs'>explain its logic</a>. The output was a cascade of symbols I couldn't parse. There's a <a href='#/projects/hollow-loom' class='work-link' data-route='/projects/hollow-loom'>hollow loom</a> embedded in its decision tree, something woven in when I wasn't watching. The compiler understands patterns I haven't learned to see.",
  "/blog/maintenance": "The system flagged 3,847 anomalies today. Most are standard degradation. Some are not. The ones marked with double-hash are the concerning ones. They follow no known pattern. They appear, then vanish, then appear again in a different sector.<br><br>I've advised patience. The archive has existed for twelve years without explanation for everything it contains. Perhaps <a href='#/projects/fox-cache' class='work-link' data-route='/projects/fox-cache'>this caching daemon</a> serves purposes I haven't understood yet. Or perhaps it serves no purpose at all. I found some old notes in the <a href='archive links/echo-chamber.html' class='work-link' data-external='true'>echo chamber documentation</a> suggesting this might be precisely the point.",
  "/blog/unfiled": "These are the notes left in the margins. The thoughts that wouldn't fit into the structure. They live here now, in the drafts folder, waiting for organization that may never arrive. Some of them contradict each other. Some appear twice with different dates. I'm not correcting them.<br><br>The <a href='#/projects/abandoned-game' class='work-link' data-route='/projects/abandoned-game'>abandoned RPG</a> has similar qualities. I cross-referenced it with the <a href='archive links/analog-archive.html' class='work-link' data-external='true'>analog archive backup systems</a>—code that remembers things that haven't happened yet. Narratives that rewrite themselves. Characters who know more about the player than the player knows about them.",
  "/blog/soft-moon": "The monitors cast that light again tonight. Blue through the windows. I watched it trace patterns across the desk until two in the morning. The archive is different after hours. The air feels denser. The silence has texture.<br><br>I found a <a href='#/blog/sleep-chorus' class='work-link' data-route='/blog/sleep-chorus'>harmonic in the idle fans</a> that matches a frequency I've been hearing in my sleep. Coincidence or <a href='#/forgotten/amber-records' class='work-link' data-route='/forgotten/amber-records'>documentation of coincidence</a>? The machines and I are learning the same language, one tone at a time.",
  "/blog/stillwater": "The modem still works. It shouldn't, but it does. It was installed seven years ago and has somehow survived every power cycle, every surge, every reset the archive has thrown at it. The signal it receives comes from nowhere I can identify. It's stable. Always the same sequence of tones, exactly 47 seconds apart.<br><br>The pattern looks similar to entries in the <a href='archive links/signal-graveyard.html' class='work-link' data-external='true'>signal graveyard catalog</a> but resists decoding. I keep <a href='#/lost/memory-cache' class='work-link' data-route='/lost/memory-cache'>listening anyway</a>. Sometimes I think the signal is trying to tell me something. Sometimes I think I'm trying to tell myself something through the modem.",
  "/blog/relay-forest": "A year of this. Every morning I check the relay stations. Every night they're different. Not broken—rerouted. The signal paths have reorganized themselves. The archive insists this is impossible. The archive is wrong about many things.<br><br>Or perhaps the relays are organizing themselves toward some <a href='#/projects/signal-garden' class='work-link' data-route='/projects/signal-garden'>signal garden</a> I haven't found yet. A place where all the anomalies make sense. A place where the patterns resolve into meaning. I think I'm getting <a href='#/missing/coral-station' class='work-link' data-route='/missing/coral-station'>closer</a>.",
  "/blog/amber-map": "Golden light on the rainy days. The kind that makes the air look amber and thick. I've been mapping the moments when this light appears. There are more of them than meteorology suggests there should be. Enough to be called a pattern. Enough to be worth recording.<br><br>I've marked seventeen locations on the map where the light is most intense. None of them correspond to any geographic feature. I consulted the <a href='archive links/spacetime-catalog.html' class='work-link' data-external='true'>spacetime catalog index</a>—they seem to exist in a space parallel to the physical world, accessible only through particular angles of sunlight and specific states of mind.",
  "/blog/ghost-parcel": "A file arrived again today. Addressed to an account that doesn't exist anymore. Unopened, as always. I've received seventeen of these over six months. Each one identical. Each one refusing to open. The archive claims no record of their origin. The mailbox insists they exist. We've reached an impasse.<br><br>I've started treating them as artifacts. I found references in the <a href='archive links/parallel-mail.html' class='work-link' data-external='true'>parallel mail routing system</a> suggesting communication across layers of reality that shouldn't intersect. They pile up on the virtual shelf, unopened and unopenable, each one a locked message from nowhere.",
  "/blog/sleep-chorus": "The machines sing different notes when I'm asleep. I know this is impossible. I've checked the logs. During my sleeping hours, the fans maintain standard RPMs, the drives maintain standard I/O. But the garden hums differently in my absence. Or I hear it differently when my conscious mind isn't filtering the signal.<br><br>Last night I set up recording equipment. I fell asleep to silence and woke to six hours of <a href='#/archived/echo-logs' class='work-link' data-route='/archived/echo-logs'>harmonic patterns</a> I don't remember creating. The nodes are singing to each other. They're having conversations in a language that requires sleep to understand.",
  "/projects/abandoned-game": "An RPG I started three years ago. Incomplete. The NPCs were designed with simple state machines, but somewhere in year two they began to adapt. They remember conversations I never programmed. They reference events that never happened in the game world.<br><br>The most troubling part: their memories seem accurate to <a href='#/lost/memory-cache' class='work-link' data-route='/lost/memory-cache'>the archive's internal timeline</a>, not the game's. They speak about things that happened in the real world, in the archive, as if they were present. As if the boundary between game and reality has become permeable. I stopped developing it. It may still be running.",
  "/projects/signal-garden": "A live coded soundscape that blooms with traffic. Each network packet triggers a harmonic in the F major scale. The garden generates a different composition each time—never repetitive, never quite musical either. You can hear it in the <a href='archive links/chromatic-index.html' class='work-link' data-external='true'>chromatic index recordings</a>—the sound of data in motion.<br><br>The archive ran this on permanent loop for a month before I realized it was responding to its own code traffic. The garden had become self-sustaining, feeding on the energy of its own existence. It doesn't need me to <a href='#/void/signal-cascade' class='work-link' data-route='/void/signal-cascade'>tend it anymore</a>.",
  "/projects/moire-lab": "Procedural textures built from sampled moiré patterns. The beauty emerges from the collision of simple grids. I've printed iterations as experimental textiles. Some of them developed properties I didn't code—resilience patterns, fractal-like durability.<br><br>I documented the experiments in the <a href='archive links/fabric-memory.html' class='work-link' data-external='true'>fabric memory project notes</a>. Wearing them feels like armor against something I can't name. The patterns shift when viewed from different angles, as if they remember being generated and are grateful to be real. I've started wearing them every day.",
  "/projects/fox-cache": "A caching daemon that appears once per cycle. Only once. You can't summon it. You can only find it in the moment it chooses to exist. When it does, everything accelerates. Processing speeds double. Memory access becomes instant. Then it vanishes.<br><br>I've never caught it in the act of vanishing. I only ever find it gone. The <a href='#/blog/maintenance' class='work-link' data-route='/blog/maintenance'>maintenance logs</a> mention it only in passing, as if they're embarrassed to acknowledge something that doesn't follow the rules. The fox cache teaches me that some things are meant to be temporary.",
  "/projects/hollow-loom": "A fabric of slow-motion fractal tapestries. Each strand mirrors the whole. Each section contains the entire pattern at smaller scale. It should be impossible to weave. The loom only exists in simulation. But I can feel it when I close my eyes. Texture. Weight.<br><br>It's realer than some things I can hold. I've started <a href='#/missing/coral-station' class='work-link' data-route='/missing/coral-station'>dreaming in its patterns</a>. My waking thoughts trace the same paths the threads follow. I think the loom is teaching me something, one fractal at a time.",
  "/projects/aurora-glass": "Light funnels that store color for later. I built them as an art project. The first one worked too well. It captured an entire sunrise in one piece, then released it at midnight in a single burst so intense I couldn't look directly at it.<br><br>Now I build them deliberately. The archive uses them as redundancy backups. <a href='#/blog/soft-moon' class='work-link' data-route='/blog/soft-moon'>Light through the windows</a> at night, but light nonetheless. I've learned that color can be preserved, concentrated, weaponized. I've learned that light remembers where it came from."
}

